Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetOrthogonalAttributes Methods
The CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Class
Tekla.Structures.Drawing Namespace